{"AirRaid\n": "\nThe player controls a ship which scrolls side-to side directly above two buildings, with the objective of protecting the buildings from being destroyed by the bombs of enemy ships above.\n\n\n", "Alien\n": "\nThe game is a first person shooter (FPS) with survival horror elements. It consists of ten levels, the first nine taking place in the Xenomorph-infested USM Auriga, with the last aboard the mercenary ship Betty.\nThe player uses four different characters from the movie. Ripley is the main playable character for a majority of the game's levels, while Call, DiStephano, and Christie each get their own level as well. Each character has their own special equipment. Some players have different weapons. The selection includes a laser rifle, double barrel shotgun, grenade launcher, Shock rifle, flamer-thrower and a rocket launcher.\nThe player must complete different tasks to progress across the game. These include killing clones and ejecting overheating escape pods.\nIn addition to traditional drone aliens, the player also faces marines and facehuggers (if the player is implanted with an alien, they must track down a device to remove it, or the creature will hatch and the game ends), later fighting boss creatures such as the alien queen and the newborn.\n\n\n", "Amidar\n": "\n\nAs in Pac-Man, the player is opposed by enemies who kill on contact. The enemies gradually increase in number as the player advances from one level to the next, and their speed also increases.\nOn odd-numbered levels, the player controls an ape (in some versions labeled \"Copier\"), and must collect coconuts while avoiding headhunters (labeled \"Police\" and \"Thief\"). On even-numbered levels, the player controls a paint roller (labeled \"Rustler\"), and must paint over each spot of the board while avoiding pigs (labeled \"Cattle\" and \"Thief\"). Each level is followed by a short bonus stage.\nWhenever a rectangular portion of the board is cleared (either by collecting all surrounding coconuts, or painting all surrounding edges), the rectangle is colored in, and in the even levels, bonus points are awarded (In odd-numbered levels, the player collects points for each coconut eaten). When the player clears all four corners of the board, he is briefly empowered to kill the enemies by touching them (just as when Pac-Man uses a \"power pill\"). Enemies killed in this way fall to the bottom of the screen and revitalise themselves after a few moments.\nThe game controls consist of a joystick and a single button labeled \"Jump,\" which can be used up to three times, resetting after a level is cleared or the player loses a life. Pressing the jump button does not cause the player to jump, but causes all the enemies to jump, enabling the player to walk under them.\nExtra lives are given at 50,000 points, and per 80,000 scored up to 930,000; after that, no more lives.\n\n\n", "Assault\n": "\nThe gameplay originally focuses on the Office of Strategic Services (OSS), an American espionage organization during World War II, placing emphasis on using false papers and silenced pistols, but as the series and the technology has progressed, it has shifted emphasis towards front-line combat. Since the release of Medal of Honor: Rising Sun the series has focused on providing a more open-ended element to the games, allowing the player to have more options in each level instead of a linear path. The violence, up to Medal of Honor: Rising Sun is bloodless and simple, usually consisting of elaborate animations, while the violence in Medal of Honor: Pacific Assault and onward contains the occasional sprays of blood.\n\n\n", "Asterix\n": "\n\nThe player controls the short and mustached Gaul who has to progress through levels located all across Europe, fighting Romans and various aggressive animals along the way, to rescue his friend Obelix before Caesar throws him to the lions. The gameplay takes place in 50 BC. Gaul is entirely occupied by the Romans. One small Gaulish village continues to defy the occupying forces, thanks to a magic potion which makes them invincible. But now Obelix has vanished. The Romans have confirmed his capture and taken him to an unknown destination.\n\n\n", "Asteroids\n": "\n\nThe objective of Asteroids is to destroy asteroids and saucers. The player controls a triangular ship that can rotate left and right, fire shots straight forward, and thrust forward. Once the ship begins moving in a direction, it will continue in that direction for a time without player intervention unless the player applies thrust in a different direction.  The ship eventually comes to a stop when not thrusting. The player can also send the ship into hyperspace, causing it to disappear and reappear in a random location on the screen, at the risk of self-destructing or appearing on top of an asteroid.Each level starts with a few large asteroids drifting in various directions on the screen. Objects wrap around screen edges – for instance, an asteroid that drifts off the top edge of the screen reappears at the bottom and continues moving in the same direction. As the player shoots asteroids, they break into smaller asteroids that move faster and are more difficult to hit. Smaller asteroids are also worth more points. Two flying saucers appear periodically on the screen; the \"big saucer\" shoots randomly and poorly, while the \"small saucer\" fires frequently at the ship. After reaching a score of 40,000, only the small saucer appears. As the player's score increases, the angle range of the shots from the small saucer diminishes until the saucer fires extremely accurately. Once the screen has been cleared of all asteroids and flying saucers, a new set of large asteroids appears, thus starting the next level. The game gets harder as the number of asteroids increases until after the score reaches a range between 40,000 and 60,000. The player starts with 3-5 lives upon game start and gains an extra life per 10,000 points. When the player loses all their lives, the game ends. Machine \"turns over\" at 99,990 points, which is the maximum high score that can be achieved.\nAsteroids contains several bugs. The game slows down as the player gains 50-100 lives, due to a programming error in that there is no limit for the permitted number of lives. The player can \"lose\" the game after more than 250 lives are collected.\n\n\n", "Atlantis\n": "\n\nThe player controls the last defenses of the City of Atlantis against the Gorgon invaders. The city has seven bases, which are vulnerable to attack. Three of these have firepower capabilities to destroy the Gorgon ships before they manage to fire death rays at one of the settlements. The gun bases have fixed cannons; the center base fires straight up, while the far left and far right bases fire diagonally upwards across the screen. The center cannon also creates a shield that protects the settlements from the death rays, so once the center cannon is destroyed, the remaining settlements become vulnerable to attack. The enemy ships pass back and forth from left to right four times before they enter firing range, giving an ample opportunity to blow them away. Lost bases can be regained by destroying enough Gorgon ships.\nRegardless of the player's efforts to avert the tragedy, Atlantis is doomed. The only way the game can end is when all bases are destroyed. However, a tiny ship then rises from the rubble and speeds away, making a connection with another Imagic game, Cosmic Ark.The Intellivision version features two gun turrets with a movable cursor that can be aimed onto enemy ships. There is also a deploy-able ship to take on enemies one-on-one. The game features day, dusk, and night settings, with the night setting limiting visibility to two moving searchlights.\n\n\n", "BattleZone\n": "\nThe primary resource in Battlezone is bio-metal scrap which is used to produce new units and construct new buildings. Building and directing units is done via interface either by selecting onscreen object with the mouse or by using number keys on keyboard. Starting with a bio-metal recycler (the most basic construction unit), the player constructs vehicles to scavenge scraps of bio-metal, build base defenses, and construct new base vehicles capable of building more advanced structures and vehicles.\nPlayers can acquire bio-metal scrap by either finding it or salvaging it from a destroyed enemy unit. When a ship is destroyed, the pilot ejects and thus becomes vulnerable to being killed, but can escape by boarding any friendly vehicle.\n\n\n", "BeamRider\n": "\nBeamrider takes place above Earth's atmosphere, where a large alien shield called the Restrictor Shield surrounds the Earth.  The player's objective is to clear the Shield's 99 sectors of alien craft while piloting the Beamrider ship.  The Beamrider is equipped with a short-range laser lariat and a limited supply of torpedoes.  The player is given three at the start of each sector.\nTo clear a sector, fifteen enemy ships must be destroyed.  A \"Sentinel ship\" will then appear, which can be destroyed using a torpedo (if any remain) for bonus points.  Some enemy ships can only be destroyed with torpedoes, and some must simply be dodged.  Occasionally during a sector, \"Yellow Rejuvenators\" (extra lives) appear.  They can be picked up for an extra ship, but if they are shot they will transform into ship-damaging debris.\nActivision offered a Beamrider patch to players who could get to Sector 14 with 40,000 points and sent in a screenshot of their accomplishment.\n\n\n", "Berzerk\n": "\n\nThe player controls a green stick man. Using a joystick and a firing button that activates a laser-style weapon, the player navigates a simple maze filled with many robots, who fire lasers back at the player character. A player can be killed by being shot, by running into a robot or an exploding robot, getting electrocuted by the electrified walls of the maze itself, or by being touched by the player's nemesis, Evil Otto.\nThe function of Evil Otto, represented by a bouncing smiley face, is to quicken the pace of the game. Otto is unusual, with regard to games of the period, in that he's indestructible. Otto can go through walls with impunity and hunts the player character. If robots remain in the maze Otto moves slowly, about half as fast as the humanoid, but he speeds up to match the humanoid's speed once all the robots are killed. Evil Otto moves at exactly the same speed as the player going left and right but he can move faster than the player going up and down; thus, no matter how close Otto is, the player can escape as long as they can avoid moving straight up or down.\nThe player advances by escaping from the maze through an opening in the far wall. Each robot destroyed is worth 50 points. If all the robots in the current maze have been destroyed before the player escapes, the player gains ten points per robot. The game has 65,536 rooms (256×256 grid), but due to limitations of the random number generation there are fewer than 1,024 maze layouts (876 of which are unique). It has only one controller, but two-player games can be accomplished by alternating at the joystick.\nAs a player's score increases, the colors of the enemy robots change, and the robots can have more bullets on the screen at the same time. Once they reach the limit of simultaneous on-screen bullets, they cannot fire again until one or more of their bullets detonates; the limit applies to the robots as a group, not as individuals.\nA free life can be awarded at 5,000 or 10,000 points, set by internal DIP switches, with no extra lives thereafter.\nThe game's voice synthesizer generates speech for the robots during certain in-game events:\n\n\"Coin detected in pocket\": During attract mode, specifically while showing the high score list.\n\"Intruder alert! Intruder alert!\": Spoken when Evil Otto appears.\n\"The humanoid must not escape\" or \"The intruder must not escape\": Heard when the player escapes a room after destroying every robot.\n\"Chicken, fight like a robot\": Heard when the player escapes a room without destroying every robot.\n\"Got the humanoid, got the intruder!\": Heard when the player loses a life. (The \"got the intruder\" part is a minor third higher than the \"got the humanoid\" part.)There is random robot chatter playing in the background, with phrases usually consisting of \"Charge\", \"Attack\", \"Kill\", \"Destroy\", \"Shoot\", or \"Get\", followed by \"The Humanoid\", \"The intruder\", \"it\", or \"the chicken\" (the last only if the player got the \"Chicken, fight like a robot\" message from the previous room), creating sentences such as \"Attack it\", \"Get the Humanoid\", \"Destroy the intruder\", \"Kill the chicken\", and so on. The speed and pitch of the phrases vary, from deep and slow, to high and fast.\n\n\n", "Bowling\n": "\nIn all six variations, games last for 10 frames, or turns.  At the start of each frame, the current player is given two chances to roll a bowling ball down an alley in an attempt to knock down as many of the ten bowling pins as possible.  The bowler (on the left side of the screen) may move up and down his end of the alley to aim before releasing the ball.  In four of the game's six variations, the ball can be steered before it hits the pins.  Knocking down every pin on the first shot is a strike, while knocking every pin down in both shots is a spare.  The player's score is determined by the number of pins knocked down in all 10 frames, as well as the number of strikes and spares acquired.\n\n\n", "Breakout\n": "\n\nBreakout begins with eight rows of bricks, with each two rows a different color. The color order from the bottom up is yellow, green, orange and red. Using a single ball, the player must knock down as many bricks as possible by using the walls and/or the paddle below to ricochet the ball against the bricks and eliminate them. If the player's paddle misses the ball's rebound, they will lose a turn. The player has three turns to try to clear two screens of bricks. Yellow bricks earn one point each, green bricks earn three points, orange bricks earn five points and the top-level red bricks score seven points each. The paddle shrinks to one-half its size after the ball has broken through the red row and hit the upper wall. Ball speed increases at specific intervals: after four hits, after twelve hits, and after making contact with the orange and red rows.\nThe highest score achievable for one player is 896; this is done by eliminating two screens of bricks worth 448 points per screen. Once the second screen of bricks is destroyed, the ball in play harmlessly bounces off empty walls until the player restarts the game, as no additional screens are provided.  However, a secret way to score beyond the 896 maximum is to play the game in two-player mode. If \"Player One\" completes the first screen on their third and last ball, then immediately and deliberately allows the ball to \"drain\", Player One's second screen is transferred to \"Player Two\" as a third screen, allowing Player Two to score a maximum of 1,344 points if they are adept enough to keep the third ball in play that long. Once the third screen is eliminated, the game is over.\nThe original arcade cabinet of Breakout featured artwork that revealed the game's plot to be that of a prison escape. According to this release, the player is actually playing as one of a prison's inmates attempting to knock a ball and chain into a wall of their prison cell with a mallet. If the player successfully destroys the wall in-game, their inmate escapes with others following.\n\n\n", "Carnival\n": "\n\nThe goal of the game is to shoot at targets while conserving a limited ammunition supply for as long as possible. The controls for the standard upright version of Carnival consist of buttons for firing and left/right movement. The cocktail version replaces the directional buttons with a two-way joystick. \nThree rows of targets scroll across the screen in alternating directions; these include rabbits, ducks, owls, and extra-bullet targets, with higher rows awarding more points. If a duck reaches the bottom row without being shot, it will come to life and begin flying down toward the player. Any ducks that reach the bottom of the screen in this manner will eat some of the player's bullets. A large pop-up target above the top row can either award or subtract bullets or points when hit. A spinning wheel with eight pipes also sits above the top row; the point value of the pipes decreases for every shot that does not hit one of them. In addition, a bonus counter increases by the value of every target shot in the three rows, and can be collected by shooting the letters of the word \"BONUS\" in order as they cycle through the rows. The bonus stops increasing as soon as any letter is shot.\nA round ends when all targets and pipes have been shot. The player receives bonus points for all unused bullets, then plays a bonus round in which a large bear with a target walks across the screen. Each time the bear is shot, it rears up for a second, then begins walking more quickly in the other direction. The object is to shoot the bear as many times as possible until it escapes off the screen, using unlimited ammunition. Following the bonus round, the next wave begins. Later bonus rounds add more bears to the screen.\nIn higher levels, there are more ducks and fewer extra-bullet targets, putting a premium on accurate shooting. The game ends when the player runs out of bullets.\n\n\n", "Centipede\n": "\n\nIn the original arcade version: The player's fighter is represented by a small insect-like head at the bottom of the screen called the Bug Blaster. The player moves it around the bottom area of the screen with a trackball and fires small darts at a segmented centipede advancing from the top of the screen down through a field of mushrooms.  Each segment of the centipede becomes a mushroom when shot; shooting one of the middle segments splits the centipede into two pieces at that point. Each piece then continues independently on its way down the screen, with the rear piece sprouting its own head. If the centipede head is destroyed, the segment behind it becomes the next head. Shooting the head is worth 100 points while the other segments are 10. The centipede starts at the top of the screen, traveling either left or right.  When it touches a mushroom or reaches the edge of the screen, it descends one level and reverses direction. The player can destroy mushrooms by shooting them, but each takes four shots to destroy. At higher levels, the screen can become increasingly crowded with mushrooms due to player/enemy actions, causing the centipede to descend more rapidly.\n\nOnce the centipede reaches the bottom of the screen, it moves back and forth within the player area and one-segment \"head\" centipedes will periodically appear from the side. This continues until the player has eliminated both the original centipede and all heads.  When all the centipede's segments are destroyed, another one enters from the top of the screen. The initial centipede is 10 or 12 segments long, including the head; each successive centipede is one segment shorter and accompanied by one detached, faster-moving head. This pattern continues until all segments are separate heads, after which it repeats with a single full-length centipede.\nThe player also encounters other creatures besides the centipedes. Fleas drop vertically and disappear upon touching the bottom of the screen, occasionally leaving a trail of mushrooms in their path when only a few mushrooms are in the player movement area; they are worth 200 points and takes two shots to destroy. Spiders move across the player area in a zig-zag pattern and eat some of the mushrooms; they are worth 300, 600, or 900 points depending on how close the player shoots it. Scorpions move horizontally across the screen, turning every mushroom they touch into poison mushrooms. Scorpions are also worth the most points of all enemies with 1,000 points each. A centipede touching a poison mushroom will attack straight down toward the bottom, then return to normal behavior upon reaching it. This \"poisoned\" centipede can be both beneficial and detrimental to the player; the player can destroy them rapidly as it descends down, while at the same time, they can be very challenging to avoid, especially if already split into multiple segments.\nThe Bug Blaster will be destroyed when hit by any enemy, after which any poisonous or partially damaged mushrooms revert to normal. 5 points are awarded for each regenerated mushroom. The player gains extra lives every 12,000 points (10,000 in several ported versions). \n\n\n", "ChopperCommand\n": "\n\nIn Chopper Command the player controls a military helicopter in a desert scenario protecting a convoy of trucks. The goal is to destroy all enemy fighter jets and helicopters that attack the player's helicopter and the friendly trucks traveling below, ending the current wave. The game ends when the player loses all of his or her lives or reaches 999,999 points. A radar, called a Long Range Scanner in the instruction manual, shows all enemies, including those not visible on the main screen.\nA player who achieved 10,000 points could send in a photo of the TV screen and receive a \"Chopper Commandos\" patch.\n\n\n", "DemonAttack\n": "\n\nMarooned on the ice planet Krybor, the player uses a laser cannon to destroy legions of demons that attack from above. Visually, the demons appear in waves similar to other space-themed shooters, but individually combine from the sides of the screen to the area above the player's cannon.\nEach wave introduces new weapons with which the demons attack, such as long streaming lasers and laser clusters. Starting in Wave 5, demons also divide into two smaller, bird-like creatures that eventually attempt descent onto the player's cannon. Starting in Wave 9, the demons' shots follow directly beneath the monsters, making it difficult for the player to slip underneath to get in a direct shot.\n\n\n", "DoubleDunk\n": "\n\nDouble Dunk is a simulation of two-on-two, half-court basketball. Teams have two on-screen characters, a shorter \"outside\" man and a taller \"inside\" man. In a single-player game, the player controls the on-screen character closest to the ball, either the one holding the ball (on offense) or the one guarding the opponent with the ball (on defense). In two-player games, each player may control one of the two teams as in a one-player game, or both players may play on the same team against a computer-controlled opponent. At the start of each possession, both offense and defense select from a number of plays (such as the pick and roll on offense), then attempt to score or regain possession of the ball by intercepting or stealing it from the offense.The game offers a number of player-selectable options. Games can be set to last a certain amount of time or until one team scores a certain number of points. Three-point shots can be turned on or off, as can a ten-second shot clock. Players may also choose to include foul detection and/or a three-second lane violation.\n\n\n", "ElevatorAction\n": "\n\nThe player assumes the role of Agent 17, codename: \"Otto\", a secret agent for an unspecified organization or government. Otto enters a 30-story building at roof level and must work his way down to the basement, collecting secret documents whose locations are marked by red doors. Along the way, he must use the building's elevator and escalator systems to move from floor to floor and avoid or kill the enemy agents trying to stop him. After picking up all the documents, Otto can escape to the basement and drive away in a waiting car to end the level. \nThe player controls consist of a four-position joystick and separate buttons to control jumping and firing. Otto can move left and right, jump, duck, and fire up to three shots at a time from his pistol. While Otto is in an elevator, the player can push up or down to send him to a higher or lower floor; however, Otto cannot duck as long as he is inside. He can run or jump across an empty shaft as long as the elevator is above him, and can ride on its roof but not control its motion or cross to the other side. The player can push up or down to make Otto ride an escalator.\nIf Otto tries to leave the building without collecting all the documents, he will be transported to the highest floor that still has an unopened red door and must work his way back down. In addition, if he takes too long to clear a level, an alarm will sound; the enemy agents then become more aggressive, and the elevators will be slower to respond to the player's joystick movements.\nEach building contains a section in which the lights are out, making it harder to see approaching enemies. On other floors, Otto can temporarily disable the lights by shooting one of the overhead fixtures. Otto can kill enemy agents by shooting them, jump-kicking them at close range, dropping a light fixture on their heads, or crushing them with an elevator. If he is shot or crushed, or if he falls down an open shaft, the player loses one life. \nThe background music is the same for all levels and only changes when the hidden time limit expires. As Otto lands on the first building's rooftop at the start of the game, Chopin's Piano Sonata No. 2, popularly known as Funeral March, is briefly heard.\n\n\n", "Enduro\n": "\n\nEnduro consists of maneuvering a race car in the National Enduro, a long-distance endurance race. The object of the race is to pass a certain number of cars each day. Doing so will allow the player to continue racing for the next day. The driver must avoid other racers and pass 200 cars on the first day, and 300 cars with each following day.As the time in the game passes, visibility changes as well. When it is night in the game the player can only see the oncoming cars' taillights. As the days progress, cars will become more difficult to avoid as well. Weather and time of day are factors in how to play. During the day the player may drive through an icy patch on the road which would limit control of the vehicle, or a patch of fog may reduce visibility.If a player succeeds in racing five days or more, an on-screen racing trophy pop-ups. At the time of release, if the player sent a photograph of this achievement to Activision, they received a patch declaring them an \"Activision Roadbuster.\"\n\n\n", "FishingDerby\n": "\n\nIn Fishing Derby, two fishermen sit on opposite docks over a lake filled with fish (and a shark that passes through). Using the joystick the player is able to move the fishing line left, right, up, and down in the water. When a fish is hooked, the line slowly comes up to the surface of the water. Pressing the fire button on the joystick reels in the fish faster. However, if both fishermen have hooked fish, only one person can reel it in (the one who first hooked the fish). The shark that roams the water will try to eat hooked fish before they surface.\nThe objective for both fishermen is to reach 99 pounds of fish first. There are six rows of fish; the top two rows have 2 lb. fish, the middle two rows have 4 lb. fish and the two bottom rows have 6 lb. fish. The more valuable fish sit at the bottom, but they are harder to bring in as they run a higher risk of being eaten by the shark.\nThe game's two variants are simply single-player and multi-player.  In both games the objective is to reach 99 lb. of fish first.\n\n\n", "Gopher\n": "\n\nThe gopher tunnels left and right and up to the surface. When he makes a hole to the surface he will attempt to steal a carrot. The farmer must hit the gopher to send him back underground or fill in the holes to prevent him from reaching the surface. If gopher has taken any of the three carrots, a pelican will occasionally fly overhead and drop a seed which, if the farmer catches it, he can plant it in the place of the missing carrot. The longer the game, the faster the gopher gets. The game ends when the gopher successfully removes all three carrots. There are two skill levels and is for one or two players, giving a total of four game variations.\n\n\n", "Gravitar\n": "\nThe player controls a small blue spacecraft. The game starts in a fictional solar system with several planets to explore. If the player moves his ship into a planet, he will be taken to a side-view landscape. Unlike many other shooting games, gravity plays a fair part in Gravitar: the ship will be pulled slowly to the deadly star in the overworld, and downward in the side-view levels.\nThe player has five buttons: two to rotate the ship left or right, one to shoot, one to activate the thruster, and one for both a tractor beam and force field. Gravitar, Asteroids, Asteroids Deluxe and Space Duel all used similar 5-button controlling system.\nIn the side-view levels, the player has to destroy red bunkers that shoot constantly, and can also use the tractor beam to pick up blue fuel tanks. Once all of the bunkers are destroyed, the planet will blow up, and the player will earn a bonus. Once all planets are destroyed, the player will move onto another solar system.\nThe player will lose a life if he crashes into the terrain or gets hit by an enemy's shot, and the game will end immediately if fuel runs out.\nGravitar has 12 different planets. Red Planet is available in all 3 phases in the universe; it contains a reactor. Shooting the reactor core activates a link. Escaping the reactor successfully moves the player to the next phase of planets, awards bonus points and 7500 units of fuel. Reactor escape time reduces after each phase and eventually becomes virtually impossible to complete.\n\nAfter completing all 11 planets (or alternatively completing the reactor three times) the player enters the second universe and the gravity will reverse. Instead of dragging the ship towards the planet surface, the gravity pushes it away. In the third universe the landscape becomes invisible and the gravity is positive again. The final, fourth universe, has invisible landscape and reverse gravity. After completing the fourth universe the game starts over. However, the reactor escape time will never reset back to high levels again.\nThe programmers thought that even the best players could never complete the most difficult planets on the invisible levels. Neither of the key developers themselves, Mike Hally and Rich Adam, have ever completed their own game in their own words: \"without cheating.\"\n\n\n", "IceHockey\n": "\nThe play and mechanics of Ice Hockey are mostly similar to that of ice hockey in real life. The objective for both team is to hit a black puck with a hockey stick that each player carries into the opponent's goal. Teams are made up of five players including the goaltender, as opposed to six in real life. Players wear ice skates, which are used to skate across the icy arena. Each game is made up of three periods, with the victory going to the team who has the most points at the end of the game. At the beginning, two opposing players from each team face off in the middle of the rink. There are three kinds of players - the first is fast, weak, and feeble, but is good at the face-off; the second is average in all qualities, and the third is slow and poor at the face-off, but very powerful, both in body checking and shooting strength. The arena is similarly designed to a real-world ice hockey arena. The arena is coated in ice, with a goal on either side of the arena. There are a variety of marked areas, including the goal line that the puck must cross to score, the attacking/defending zone which is situated closely to each goal, the face-off spot, the neutral spot, and others. Each side of the arena has exactly the same design. If two opposing players fight for the puck for a certain amount of time, other players join into the fight, resulting in the player from the losing team in the fight to be put in the penalty box for a period of time.\n\n\n", "JourneyEscape\n": "\nThe player must lead the band members to their \"Scarab Escape Vehicle\" (as featured on the cover) and protect the concert cash from \"love-crazed\" groupies, sneaky photographers, stage barriers and \"shifty-eyed\" promoters. Assisting the player are roadies, which provided short periods of immunity to obstacles, and The Manager, inexplicably depicted as the Kool-Aid Man, which allowed the player to move to the Scarab completely unhindered. The screen scrolls vertically non-stop, although the speed can be controlled; the player moves side to side to dodge the aforementioned obstacles.\n\n\n", "Kangaroo\n": "\n\nThere are four different levels. Three of them consist of the mother kangaroo on the bottom floor trying to reach the top floor where her joey is being held captive by some monkeys. On each of the levels monkeys throw apples which the mother kangaroo must either jump, duck, or punch. If she gets face to face with one of the monkeys, she can punch the monkey with a boxing glove. There are also pieces of fruit that she can jump up and get for points; if she jumps and touches a bell, more fruits will appear to replace the ones she has already collected. She must be wary of the big Ape, who will occasionally appear and try to take her gloves away from her. The level must be completed before the time runs out; otherwise, the player will lose a life.\nLevels 1, 2 and 4 consist of different platforms that the mother kangaroo must jump onto or climb onto via a ladder. On the third level, the joey is in a cage held up by a troop of monkeys, and there is a horde of apples that will be unleashed if five monkeys climb up to it. On this level, the mother kangaroo must punch each monkey in the stack several times until the cage is lowered and, when the cage has been lowered enough, the mother kangaroo must climb to the next floor to get to the joey before the cage is raised again.\nKangaroo has a number of clearly visible glitches in the graphics, such as sprites briefly flickering.The game uses classical and folk songs, including \"American Patrol\" by F. W. Meacham (during regular gameplay), \"Oh! Susanna\" by Stephen Foster (level completion fanfare), and \"Westminster Quarters\" (when a bell is rung).\n\n\n", "Krull\n": "\n\nThe game  generally follows the plot of the movie, and takes place on four separate screens. The first level begins with the player, as Colwyn, at his wedding to Lyssa, which is interrupted by the extraterrestrial Slayers. The game continues to generate new Slayers for the player to fight until he is overwhelmed and Lyssa is abducted to the Black Fortress.\nThe player then traverses the Iron Desert on a Fire Mare, stocking up on Colwyn's magical throwing weapon, the Glaive (in the film there is only one), by pressing the button each time the horse rides over one.\nThe next level takes place in the lair of the Widow of the Web. The player is required to jump between moving threads of web, working their way upward towards the Widow at the top of the screen, while avoiding a giant spider. After completing this task, the Widow reveals the location of the Black Fortress, and the player again rides a Fire Mare through the Iron Desert to reach it. If the player fails to arrive at the given location at the correct time of day, according to a timer at the top of the screen, he loses a life and must return to the Widow to find out the Fortress's new location.\nUpon reaching the Black Fortress, the player must penetrate the energy barrier surrounding Lyssa with the Glaive (of which the player has a limited number), while the Beast attempts to block the player's shots and hit him with fireballs. If the Glaive hits the Beast, or is not caught on the rebound by the player, that Glaive is lost. If all of the player's Glaives are lost, he is expelled from the Fortress and must return to the Widow of the Web level, discover the new location of the Black Fortress, and traverse the Iron Desert again.\nIf the player manages to break through the barrier surrounding Lyssa, she transforms into a fireball which the player can throw at the Beast. If the fireball hits, the player wins, and the game starts over at a higher level of difficulty.\n\n\n", "KungFuMaster\n": "\n\nThe player controls Thomas with a four-way joystick and two attack buttons to punch and kick. Unlike more conventional side-scrolling games, the joystick is used not only to crouch, but also to jump. Punches and kicks can be performed from a standing, crouching or jumping position. Punches award more points than kicks and do more damage, but their range is shorter.\nUnderlings encountered by the player include Grippers, who can grab Thomas and drain his energy until shaken off; Knife Throwers, who can throw at two different heights and must be hit twice; and Tom Toms, short fighters who can either grab Thomas or somersault to strike his head when he is crouching. On even-numbered floors, the player must also deal with falling balls and pots, snakes, poisonous moths, fire-breathing dragons, and exploding confetti balls.\nThe Devil's Temple has five floors, each ending with a different boss (described as \"sons of the devil\" at the start of the game). In order to complete a floor, Thomas must connect enough strikes to completely drain the boss's energy meter; he can then climb the stairs to the next floor. Thomas has a fixed time limit to complete each floor; if time runs out or his meter is completely drained, the player loses one life and must replay the entire floor. Upon completing a floor, the player receives bonus points for remaining time and energy. The boss of the fifth floor is Mr. X, the leader of the gang that kidnapped Sylvia. Once he is defeated, Thomas rescues Sylvia and the game restarts at a higher difficulty level.\nAn extra life is given at 50,000 points; thereafter, the rest of the game is on \"survival of the fittest\" mode.\n\n\n", "MontezumaRevenge\n": "\nMontezuma's Revenge is an early example of the Metroidvania genre. The player controls a character called Panama Joe (a.k.a. Pedro), moving him from room to room in the labyrinthine underground pyramid of the 16th century Aztec temple of emperor Montezuma II, filled with enemies, obstacles, traps, and dangers. The objective is to score points by gathering jewels and killing enemies along the way. Panama Joe must find keys to open doors, collect and use equipment such as torches, swords, amulets, etc., and avoid or defeat the challenges in his path. Obstacles are laser gates, conveyor belts, disappearing floors and fire pits.Movement is achieved by jumping, running, sliding down poles, and climbing chains and ladders. Enemies are skulls, snakes, and spiders. The player has a limited number of inventory slots for carrying items, and cannot collect any other items or jewels if all slots are filled. A further complication arises in the bottom-most floors of each pyramid, which must be played in total darkness unless a torch is found.\nThe pyramid is nine floors deep, not counting the topmost entry room that the player drops into at the start of each level, and has 99 rooms to explore. The goal is to reach the Treasure Chamber, whose entrance is in the center room of the lowest level. After jumping in here, the player has a short time to jump from one chain to another and pick up as many jewels as possible. However, jumping onto a fireman's pole will immediately take the player to the next level; when time runs out, the player is automatically thrown onto the pole.\nThere are nine difficulty levels in all. Though the basic layout of the pyramid remains the same from one level to the next, small changes in details force the player to rethink strategy. These changes include:\n\nBlocking or opening up certain paths (by adding/removing walls or ladders)\nAdding enemies and obstacles\nRearrangement of items\nMore dark rooms and fewer torches (in level 9, the entire pyramid is dark)\nEnemies that do not disappear after they kill Panama Joe (starting with level 5)The player can reach only the left half of the pyramid in level 1, and only the right half in level 2. Starting with level 3, the entire pyramid is open for exploration.\nThe sound track of the game for the Atari 8 bit computer is a musical adaptation of Spanish Flea and the first few notes of La Cucaracha when collecting items.\n\n\n", "MsPacman\n": "\n\nPac-Man is a maze chase video game; the player controls the eponymous character through an enclosed maze. The objective of the game is to eat all of the dots placed in the maze while avoiding four colored ghosts — Blinky (red), Pinky (pink), Inky (cyan), and Clyde (orange) — that pursue him. When all of the dots are eaten, the player advances to the next level. If Pac-Man makes contact with a ghost, he will lose a life; the game ends when all lives are lost. Each of the four ghosts have their own unique, distinct artificial intelligence (A.I.), or \"personalities\"; Blinky gives direct chase to Pac-Man, Pinky and Inky try to position themselves in front of Pac-Man, usually by cornering him, and Clyde will switch between chasing Pac-Man and fleeing from him.Placed at the four corners of the maze are large flashing \"energizers\", or \"power pellets\". Eating these will cause the ghosts to turn blue with a dizzied expression and reverse direction. Pac-Man can eat blue ghosts for bonus points; when eaten, their eyes make their way back to the center box in the maze, where the ghosts are \"regenerated\" and resume their normal activity. Eating multiple blue ghosts in succession increases their point value. After a certain amount of time, blue-colored ghosts will flash white before turning back into their normal, lethal form. Eating a certain number of dots in a level will cause a bonus item, usually in the form of a fruit, to appear underneath the center box, which can be eaten for bonus points.\nThe game increases in difficulty as the player progresses; the ghosts become faster and the energizers' effect decreases in duration, to the point where the ghosts will no longer turn blue and edible. To the sides of the maze are two \"warp tunnels\", which allow Pac-Man and the ghosts to travel to the opposite side of the screen. Ghosts become slower when entering and exiting these tunnels. Levels are indicated by the fruit icon at the bottom of the screen. In-between levels are short cutscenes featuring Pac-Man and Blinky in humorous, comical situations. The game becomes unplayable at the 256th level due to an integer overflow that affects the game's memory.\n\n\n", "Phoenix\n": "\n\nThe player controls a spaceship that moves horizontally at the bottom of the screen, firing upward. Enemies, typically one of two types of birds, appear on the screen above the player's ship, shooting at it and periodically diving towards it in an attempt to crash into it. The ship is equipped with a shield that can be used to zap any of the alien creatures that attempt to crash into it. The player cannot move while the shield is active and must wait approximately five seconds before using it again.\nThe player starts with three or six lives, depending on the settings. One life is lost whenever the ship is hit by any enemy or projectile while the shield is down.\nEach level has five separate rounds. The player must complete a round to advance to the next.\n\nRounds 1 and 2 – The player must destroy a formation of alien birds. While in formation, some of the birds fly down kamikaze style, in an attempt to destroy the player's spaceship by crashing into it. Hitting a birdlike enemy flying diagonally awards a bonus score. The birdlike enemies are yellow in round 1, and pink in round 2. The player's spaceship is given rapid fire for round 2, where the birdlike creatures fly somewhat more unpredictably.\nRounds 3 and 4 – Flying eggs float on the screen and seconds later hatch, revealing larger alien birds, resembling phoenices, which swoop down at the player's spaceship. The only way to fully destroy one of these birdlike creatures is by hitting it in its belly; shooting one of its wings merely destroys that wing, and if both wings are destroyed, they will regenerate. From time to time the birdlike creatures may also revert to the egg form for a brief period. The birdlike creatures are blue in round 3, and pink in round 4.\nRound 5 – The player is pitted against the mothership, which is controlled by an alien creature sitting in its center. To complete this round, the player must create a hole in the conveyor belt-type shield to get a clear shot at the alien. Hitting the alien with a single shot ends the level and scores 400–8,200 points. The mothership fires missiles at the player's ship, moves slowly down towards it, and has alien birds (from rounds 1 and 2) protecting it. Defeating all of the birds will produce a new wave.The game continues with increasing speed and unpredictability of the birdlike creature and phoenix flights.\n\n\n", "Pitfall\n": "\n\nThe player controls the character (Pitfall Harry) through a maze-like jungle in an attempt to recover 32 treasures in a 20-minute time period. Along the way, players must maneuver through numerous hazards, including pits, quicksand, rolling logs, fire, rattlesnakes, scorpions, and crocodiles. Harry may jump over or otherwise avoid these obstacles by climbing, running, or swinging on vines. Treasure includes bags of money, gold and silver bars, and diamond rings, which range in value from 2000 to 5000 points in 1000 point increments. There are eight of each treasure type, with 32 in total. A perfect score of 114,000 is achieved by claiming all 32 treasures without losing any points. Points are deducted by either falling in a hole (100 points) or touching logs; point loss depends on how long contact is made with the log. Under the jungle there is a tunnel which Harry can access through ladders found at various points. Traveling through the tunnel moves forward three screens at a time, which is necessary in order to collect all the treasures within the time limit. However, the tunnels are filled with dead-ends blocked by brick walls, forcing the player to return to the surface at one of the ladders, and try to find a way around again, thus wasting time. The tunnels also contain scorpions. The player loses a life if Harry comes in contact with any obstacle (except logs) or falls into a tar pit, quicksand, waterhole, or mouth of a crocodile. The game ends when either all 32 treasures have been collected, all three lives have been lost, or the time has run out.\n\n\n", "Pong\n": "\n\nPong is a two-dimensional sports game that simulates table tennis. The player controls an in-game paddle by moving it vertically across the left or right side of the screen. They can compete against another player controlling a second paddle on the opposing side. Players use the paddles to hit a ball back and forth. The goal is for each player to reach eleven points before the opponent; points are earned when one fails to return the ball to the other.\n\n\n", "Pooyan\n": "\nThe player controls Mama Pig, whose babies have been kidnapped by a pack of wolves and who must rescue them using a bow and arrow and slabs of meat. Controls consist of a two-position up/down joystick, which moves an elevator in which Mama Pig rides; and a button, which fires arrows and throws meat.\nEach level consists of two rounds. In the first, wolves descend slowly from a high ledge using balloons, which the player must shoot in order to drop them to the ground. Any wolves who reach the ground safely will climb up a set of ladders behind the elevator and try to eat Mama Pig if she moves in front of them. During the second round, the wolves start on the ground and inflate balloons in order to ascend to a cliff on which a boulder is resting so they can push it toward the edge. Airborne wolves throw rocks in both rounds, trying to hit Mama Pig. In addition, the balloon carrying the last \"boss\" wolf of the second round must be shot several times in order to defeat him; if he reaches the cliff, the player must defeat additional enemies before facing the boss again.\nA slab of meat occasionally appears at the top of the elevator's range of motion. Picking it up allows the player to throw it, distracting any wolves on/near its trajectory and causing them to let go of their balloons and crash to the ground for bonus points. Stray balloons and dropped fruits can also be shot for extra points. \nAfter every second round, a bonus screen is played. The first such screen requires the player to defeat a group of wolves using only meat, while the second awards points for shooting fruits thrown by the wolves. These two screens alternate after each level.\nThe player loses one life if Mama Pig is hit by a rock, eaten by a wolf on the ladders (first round only), or crushed by the boulder if too many wolves reach the cliff and push it over the edge (second round only). When all lives are lost, the game ends.\nWhen the game starts, \"The Other Day I Met a Bear\" can be heard during the opening scene (in which the wolves kidnap Mama's babies). The first stage theme bears a very slight resemblance to the main theme music from Frogger, another Konami arcade game. The song is a part of the Desecration Rag (An operatic Nightmare) by Felix Arndt, the portion that mimics the beginning of Antonín Dvořák's Humoresque Opus 101 Number 7. After the second stage is cleared a second time, a part of \"Oh! Susanna\" can be heard.\n\n\n", "PrivateEye\n": "\nIn Private Eye, players assume the role of Pierre Touché, a private investigator who has been assigned the task of capturing the criminal mastermind, Henri Le Fiend. Le Fiend is implicated in a number of crimes across the city, and the player must find the clues and the stolen property in order to successfully arrest Le Fiend.The game consists of four separate cases. Using a specially-built Model A that can jump over obstacles, players must search the city for a specific clue to the crime and for the object stolen in the crime. Each item must then be returned to its point of origin; the clue is taken to a business to verify it came from there, and the stolen object is returned to its rightful owner. These items may be discovered in any order, but players may carry only one item at a time. When both items have been located and returned, then the player must locate and capture Le Fiend, and finally take him to jail, successfully closing the case.However, the city is full of street thugs who will attack the player. If the player is hit while carrying an item (either the clue or the stolen property), the item is lost and must be re-located. Further, each case has a statute of limitations, which serves as the game's time limit. To win the game, the player must locate and verify the clue, locate and return the stolen property, and lastly locate Le Fiend and take him to jail within the time allotted.The player starts with 1000 \"merit points\". Points are lost whenever the player hits an obstacle or is attacked by a thug, and are awarded whenever an item is located, subsequently returned, and when a thug (or Le Fiend himself) is nabbed. Each case represents a separate game variation; when the case is solved or time runs out, the game ends. A fifth variation requires the player to solve all four crimes at the same time.\n\n\n", "RoadRunner\n": "\n\nThe player controls Road Runner, who is chased by Wile E. Coyote. In order to escape, Road Runner runs endlessly to the left. While avoiding Wile E. Coyote, the player must pick up bird seeds on the street, avoid obstacles like cars, and get through mazes. Sometimes Wile E. Coyote will just run after the Road Runner, but he occasionally uses tools like rockets, roller skates, and pogo-sticks.\n\n\n", "Seaquest\n": "\n\nThe player uses a submarine to shoot at enemies and rescue divers. Enemies include sharks and submarines, which shoot missiles at the player's submarine . The player must ward off the enemies by firing an unlimited supply of missiles while trying to rescue divers swimming through the water. The points awarded to the player for shooting an enemy starts at 10 points each, and increases as the game advances. The sub can hold up to six divers at a time. Each time the player resurfaces prior to having a full load of six divers, one of the divers is removed.\nThe submarine has a limited amount of oxygen. The player must surface often in order to replenish the oxygen, but if the player resurfaces without any rescued divers, they will lose a life. If the player resurfaces with the maximum amount of divers, they will gain bonus points for the sub's remaining oxygen. Each time the player surfaces, the game's difficulty increases; enemies increase in number and speed. Eventually an enemy sub begins patrolling the surface, leaving the player without a safe haven.\nThe player starts the game with 3 extra lives, and is awarded an additional extra life each time the player scores 10,000 points.\nSeaquest can be played single-player or with two players alternating turns.\n\n\n", "Skiing\n": "\n\nSlalom is a single-player game in which players race downhill in a series of slalom races. There are 24 downhill runs total that are evenly spread across three mountains. Before the game starts, players choose their mountain based on difficulty: Snowy Hill for beginners, Steep Peak for intermediate players, and Mount Nasty for experts. The goal for each run is to reach the finish line within the allotted time. Players must dodge obstacles including trees, flags, snowmen, sledders, and other skiers on their way downhill, or else they will tumble and lose time. With enough momentum, players can jump over these obstacles. Players must ski around flags to maintain their speed. If they ski on the wrong side of the flag, the racer will snowplow and slow down.Also located on the runs are moguls (bumps) that, when hit, causes the racer to go airborne and slow down slightly when landing. While airborne, players can perform freestyle tricks and earn bonus points. However, if the player botches the trick, the racer may tumble and fall, losing time. At the end of each run, final scores are calculated based on the amount of time remaining on the run and points scored from completing freestyle tricks. If the player earns enough points, they may race the next level \"solo\" (without other skiers onscreen). The points earned in qualifying runs convert to additional seconds on the solo run timer. The high scores on each of the runs are saved in memory until the console is powered off.\n\n\n", "Solaris\n": "\nThe galaxy of Solaris is made up of 16 quadrants, each containing 48 sectors. The player uses a tactical map to choose a sector to warp to, during which they must attempt to keep their ship \"in focus\" to lower their fuel consumption rate. Fuel must be carefully managed, as an empty tank results in loss of one of the player lives. Space battle ensues whenever the player navigates into a hostile battlegroup via the tactical map. Space enemies include pirate ships, mechanoid ships, and aggressive \"cobra\" ships. Each battlegroup has at least one enemy flagship, which shoots out fuel-sapping drones. \nThe player may also descend to one of 3 types of planets.\n\nFriendly federation planets, which provide for refueling, but may also harbor a planet defense mission if they are under attack. If players allow a friendly planet in a quadrant to be destroyed, that quadrant becomes a \"red zone\" where joystick controls are reversed and booming sounds are overheard.\nEnemy Zylon planets, in which the player must rescue all cadets, gaining an extra ship when all cadets are rescued.\nEnemy corridor planets, in which the player must traverse through a fast-paced corridor.There are 4 kinds of ground enemies found on planets: stationary guardians, gliders, targeters and raiders. The ultimate goal of Solaris is to reach the planet Solaris and rescue its colonists, at which point the game ends in victory.\n\n\n", "SpaceInvaders\n": "\n\nSpace Invaders is a fixed shooter in which the player controls a laser cannon by moving it horizontally across the bottom of the screen and firing at descending aliens. The aim is to defeat five rows of eleven aliens—although some versions feature different numbers—that move horizontally back and forth across the screen as they advance toward the bottom of the screen. The player's laser cannon is partially protected by several stationary defense bunkers—the number also varies by version—that are gradually destroyed from the top and bottom by blasts from either the aliens or the player.\nThe player defeats an alien and earns points by shooting it with the laser cannon. As more aliens are defeated, the aliens' movement and the game's music both speed up. Defeating all the aliens on-screen brings another wave that is more difficult, a loop which can continue endlessly. A special \"mystery ship\" will occasionally move across the top of the screen and award bonus points if destroyed.\nThe aliens attempt to destroy the player's cannon by firing at it while they approach the bottom of the screen. If they reach the bottom, the alien invasion is declared successful and the game ends tragically; otherwise, it ends generally if the player's last cannon is destroyed by the enemy's projectiles.\n\n\n", "StarGunner\n": "\n\nStar Wars Battlefront II is mostly a third or first-person shooter, featuring both single-player and multiplayer game modes, a customizable character class system, and content based on all Star Wars movies up to The Last Jedi (with content for the other movies, as well as television series being added later on via free DLC).\n\n\n", "Tennis\n": "\nThe game includes licences for players including Rafael Nadal and Angelique Kerber. AO Tennis allows players to create their own athletes, sponsorship logos, clothing and stadiums to play in.\n\n\n", "Tutankham\n": "\nTaking on the role of an explorer grave robbing  the maze-like tomb of Tutankhamun, the player is chased by asps, vultures, parrots, bats, dragons, and curses, all of which kill the explorer on contact. The explorer wields a laser weapon that only fires left and right—there is no vertical offense—as well as a single screen-clearing \"flash bomb\" per level or life. Warp zones teleport the player to another location in the level, which enemies cannot use.\nTo progress, the player collects keys to open locked doors throughout each level and well as optional treasures for bonus points. When a timer reaches zero the explorer can no longer shoot. Passing through the large exit door ends the level, and any remaining time is converted to bonus points.\n\n\n", "Venture\n": "\n\nWinky is equipped with a bow and arrow and explores a dungeon with rooms and hallways.  The hallways are patrolled by large, tentacled monsters named Hallmonsters, which cannot be killed, injured, or stopped in any way.  Once in a room, Winky may kill monsters, avoid traps and gather treasures. If he stays in any room too long, a Hallmonster will enter the room, chase and kill him.  In this way, the Hallmonsters serve the same role as \"Evil Otto\" in the arcade game Berzerk.  The more quickly the player finishes each level, the higher their score.\nThe goal of each room is only to steal the room's treasure. In most rooms, it is possible (though difficult) to steal the treasure without defeating the monsters within.  Some rooms have traps that are only sprung when the player picks up the treasure. For instance, in \"The Two-Headed Room\", two 2-headed ettins appear the moment the player picks up the prize.\nWinky dies if he touches a monster or Hallmonster. Dead monsters decay over time and their corpses may block room exits, delaying Winky and possibly allowing the Hallmonster to enter.  Shooting a corpse causes it to regress back to its initial death phase. The monsters themselves move in specific patterns but may deviate to chase the player, and the game's AI allows them to dodge the player's shots with varying degrees of \"intelligence\" (for example, the snakes of \"The Serpent Room\" are relatively slow to dodge arrows, the trolls of \"The Troll Room\" are quite adept at evasion).\nThe game consists of three different dungeon levels with different rooms.  After clearing all the rooms in a level the player advances to the next. After three levels the room pattern and monsters repeat, but at a higher speed and with a different set of treasures.\nThe different dungeons in each level are as follows:\n\nWall Room, Serpent Room, Skeleton Room, Goblin Room\nTwo-Headed Room, Dragon Room, Spider Room, Troll Room\nGenie Room, Demon Room, Cyclops Room, Bat RoomThe highest score on the original game was set in 1982 by 15-year-old Randy Kuntz of Fairview, Alberta.\n\n\n", "VideoPinball\n": "\nPinball is a game where the player controls the paddles of a virtual pinball machine.  The game has two screens to represent the traditional pinball table and one for a bonus mode. Play begins when the player launches a ball with the plunger from the first screen—the bottom of the pinball table—through the top of the screen to the second screen. Play will move to the first screen if the ball falls through the bottom of the top screen and will return to the top screen if the ball is hit back through the space at the top of the first screen. The player controls the flippers on either screen to deflect the ball to keep it from falling off the bottom of the lower screen.\nPinball has a secondary Breakout-like mode, which the player reaches by hitting the ball into a bonus hole that takes the player to a bonus stage where they control Mario carrying a platform. The object of this mode is to rescue Pauline (previously seen in Donkey Kong). The player achieves this by bouncing the ball off Mario's platform and hitting various targets, the destruction of which also earns them points. When the blocks under her are all gone, she will drop. Catching her on Mario's platform earns the player bonus points, but allowing her to hit the ground causes the player to lose.\n\n\n", "WizardOfWor\n": "\n\nThe players' characters, called Worriors, must kill all the monsters by shooting them. Player one has yellow Worriors, on the right, and player two has blue Worriors, on the left. In a two-player game, the players are also able to shoot each other's Worriors, earning bonus points and causing the other player to lose a life. Team-oriented players can successfully advance through the game by standing back-to-back (such as in a corner) and firing at anything that comes at them.\nEach dungeon consists of a single-screen rectangular grid with walls and corridors in various formations. The Worriors and the monsters can travel freely through the corridors. Each dungeon has doors at the left and right edges, which connect with each other, making the dungeon wrap around. Whenever a door is traversed by a player or monster, both doors deactivate for a short period, making them impassable. A player who exits the door can pop back through the door immediately when the Worluk or Wizard is in the dungeon. A small radar display indicates the positions of all active monsters.\nAs long as a player has at least one life in reserve, a backup Worrior is displayed in a small sealed cubbyhole at the corresponding bottom corner of the dungeon. When the current Worrior is killed, the cubbyhole opens and the player has 10 seconds to move the backup into play before automatically being forced in.\n\nThe various monsters include the following:\n\nBurwor: A blue wolf-type creature.\nGarwor: A yellow Tyrannosaurus rex-type creature.\nThorwor: A red scorpion-like creature.\nWorluk: An Insectoid-type creature.\nWizard of Wor: A blue wizard.Both Garwors and Thorwors have the ability to turn invisible at times, but will always appear on the radar. All enemies except the Worluk can shoot at the Worriors.\nEach dungeon starts filled with six Burwors. In the first dungeon, killing the last Burwor will make a Garwor appear; in the second, the last two Burwors are replaced by Garwors when killed; and so on. From the sixth dungeon on, a Garwor will replace every Burwor when killed. On every screen, killing a Garwor causes a Thorwor to appear. There will never be more than six enemies on the screen at once. From the second dungeon on, after the last Thorwor is killed, a Worluk will appear and try to escape through one of the side doors. The level ends when the Worluk either escapes or is killed; in the latter case, all point values for the next dungeon are doubled.\nThe Wizard of Wor will appear in or after the second dungeon once the Worluk has either escaped or been killed. After a few seconds the Wizard will disappear and teleport across the dungeon, gradually approaching a Worrior. The Wizard remains in the dungeon until he shoots a Worrior or is killed. He uses a speech synthesizer to taunt the players throughout the game.\nPlayers are referred to as \"Worriors\" during the first seven levels, then as \"Worlords\" beyond that point. The \"Worlord Dungeons\" are more difficult than the earlier levels because they have fewer interior walls.\nThere are two special dungeons with increased difficulty. Level 4 is \"The Arena,\" with a large open area in its center, and Level 13 is \"The Pit,\" with no interior walls at all. A bonus Worrior is awarded before each of these levels. Every sixth dungeon after Level 13 is another Pit. A player who survives any Pit level without losing a life earns the title of \"Worlord Supreme.\"\nEach dungeon begins with a dramatic rendition of the five-note opening from \"Danger Ahead\"—the theme to the radio and television series Dragnet—with the fifth note only playing on the \"double score dungeon\" screen.\n\n\n", "YarsRevenge\n": "\n\nThe player controls an insect-like creature called a Yar who must nibble or shoot through a barrier in order to fire his Zorlon Cannon into the breach. The objective is to destroy the evil Qotile, which exists on the other side of the barrier. The Qotile can attack the Yar, even if the barrier is undamaged, by turning into the Swirl and shooting across the screen. In early levels the player is warned before the Swirl is fired and can retreat to a safe distance to dodge the attack. The Yar can hide from a pursuing destroyer missile within a \"neutral zone\" in the middle of the screen, but the Yar cannot shoot while in the zone. The Swirl can kill the Yar anywhere, even inside the neutral zone.To destroy the Qotile or the Swirl, the player has to either touch the Qotile or eat a piece of the shield to activate the Zorlon Cannon, aim the cannon by leading with the Qotile or Swirl, then fire the cannon and fly the Yar out of the path of the cannon's shot. If the weapon finds its mark, the level ends. If the cannon blast hits a piece of the shield or misses, it is expended. The cannon itself is dangerous for, once it is activated, the fire button launches it instead of firing the Yar's usual shots and, as the cannon tracks the Yar's vertical position, players effectively use the Yar itself as a target and therefore must immediately maneuver to avoid being hit by their own shot.  The cannon shot can also rebound off the shield in later levels. An extra life is earned if the player shoots the Swirl in mid-air.\n\n\n", "Zaxxon\n": "\n\nThe objective of the game is to hit as many targets as possible without being shot down or running out of fuel—which can be replenished, paradoxically, by blowing up fuel drums (300 points).There are two fortresses to fly through, with an outer space segment between them. At the end of the second fortress is a boss in the form of the Zaxxon robot.\nThe player's ship casts a shadow to indicate its height. An altimeter is also displayed; in space there is nothing for the ship to cast a shadow on. The walls at the entrance and exit of each fortress have openings that the ship must be at the right altitude to pass through. Within each fortress are additional walls that the ship's shadow and altimeter aid in flying over successfully.\n\n\n"}